virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/pio.h
/* -------- PIO_S_PIO_IOSSR : (PIO Offset: 0x38) ( R/ 32) Secure PIO I/O Security Status Register -------- */
#define PIO_S_PIO_IOSSR_P0_Pos                _U_(0)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P0_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P0_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P0(value)             (PIO_S_PIO_IOSSR_P0_Msk & ((value) << PIO_S_PIO_IOSSR_P0_Pos))
#define   PIO_S_PIO_IOSSR_P0_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P0_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P0_SECURE             (PIO_S_PIO_IOSSR_P0_SECURE_Val << PIO_S_PIO_IOSSR_P0_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P0_NON_SECURE         (PIO_S_PIO_IOSSR_P0_NON_SECURE_Val << PIO_S_PIO_IOSSR_P0_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P1_Pos                _U_(1)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P1_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P1_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P1(value)             (PIO_S_PIO_IOSSR_P1_Msk & ((value) << PIO_S_PIO_IOSSR_P1_Pos))
#define   PIO_S_PIO_IOSSR_P1_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P1_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P1_SECURE             (PIO_S_PIO_IOSSR_P1_SECURE_Val << PIO_S_PIO_IOSSR_P1_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P1_NON_SECURE         (PIO_S_PIO_IOSSR_P1_NON_SECURE_Val << PIO_S_PIO_IOSSR_P1_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P2_Pos                _U_(2)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P2_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P2_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P2(value)             (PIO_S_PIO_IOSSR_P2_Msk & ((value) << PIO_S_PIO_IOSSR_P2_Pos))
#define   PIO_S_PIO_IOSSR_P2_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P2_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P2_SECURE             (PIO_S_PIO_IOSSR_P2_SECURE_Val << PIO_S_PIO_IOSSR_P2_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P2_NON_SECURE         (PIO_S_PIO_IOSSR_P2_NON_SECURE_Val << PIO_S_PIO_IOSSR_P2_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P3_Pos                _U_(3)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P3_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P3_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P3(value)             (PIO_S_PIO_IOSSR_P3_Msk & ((value) << PIO_S_PIO_IOSSR_P3_Pos))
#define   PIO_S_PIO_IOSSR_P3_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P3_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P3_SECURE             (PIO_S_PIO_IOSSR_P3_SECURE_Val << PIO_S_PIO_IOSSR_P3_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P3_NON_SECURE         (PIO_S_PIO_IOSSR_P3_NON_SECURE_Val << PIO_S_PIO_IOSSR_P3_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P4_Pos                _U_(4)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P4_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P4_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P4(value)             (PIO_S_PIO_IOSSR_P4_Msk & ((value) << PIO_S_PIO_IOSSR_P4_Pos))
#define   PIO_S_PIO_IOSSR_P4_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P4_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P4_SECURE             (PIO_S_PIO_IOSSR_P4_SECURE_Val << PIO_S_PIO_IOSSR_P4_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P4_NON_SECURE         (PIO_S_PIO_IOSSR_P4_NON_SECURE_Val << PIO_S_PIO_IOSSR_P4_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P5_Pos                _U_(5)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P5_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P5_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P5(value)             (PIO_S_PIO_IOSSR_P5_Msk & ((value) << PIO_S_PIO_IOSSR_P5_Pos))
#define   PIO_S_PIO_IOSSR_P5_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P5_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P5_SECURE             (PIO_S_PIO_IOSSR_P5_SECURE_Val << PIO_S_PIO_IOSSR_P5_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P5_NON_SECURE         (PIO_S_PIO_IOSSR_P5_NON_SECURE_Val << PIO_S_PIO_IOSSR_P5_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P6_Pos                _U_(6)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P6_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P6_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P6(value)             (PIO_S_PIO_IOSSR_P6_Msk & ((value) << PIO_S_PIO_IOSSR_P6_Pos))
#define   PIO_S_PIO_IOSSR_P6_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P6_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P6_SECURE             (PIO_S_PIO_IOSSR_P6_SECURE_Val << PIO_S_PIO_IOSSR_P6_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P6_NON_SECURE         (PIO_S_PIO_IOSSR_P6_NON_SECURE_Val << PIO_S_PIO_IOSSR_P6_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P7_Pos                _U_(7)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P7_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P7_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P7(value)             (PIO_S_PIO_IOSSR_P7_Msk & ((value) << PIO_S_PIO_IOSSR_P7_Pos))
#define   PIO_S_PIO_IOSSR_P7_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P7_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P7_SECURE             (PIO_S_PIO_IOSSR_P7_SECURE_Val << PIO_S_PIO_IOSSR_P7_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P7_NON_SECURE         (PIO_S_PIO_IOSSR_P7_NON_SECURE_Val << PIO_S_PIO_IOSSR_P7_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P8_Pos                _U_(8)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P8_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P8_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P8(value)             (PIO_S_PIO_IOSSR_P8_Msk & ((value) << PIO_S_PIO_IOSSR_P8_Pos))
#define   PIO_S_PIO_IOSSR_P8_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P8_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P8_SECURE             (PIO_S_PIO_IOSSR_P8_SECURE_Val << PIO_S_PIO_IOSSR_P8_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P8_NON_SECURE         (PIO_S_PIO_IOSSR_P8_NON_SECURE_Val << PIO_S_PIO_IOSSR_P8_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P9_Pos                _U_(9)                                               /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P9_Msk                (_U_(0x1) << PIO_S_PIO_IOSSR_P9_Pos)                 /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P9(value)             (PIO_S_PIO_IOSSR_P9_Msk & ((value) << PIO_S_PIO_IOSSR_P9_Pos))
#define   PIO_S_PIO_IOSSR_P9_SECURE_Val       _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P9_NON_SECURE_Val   _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P9_SECURE             (PIO_S_PIO_IOSSR_P9_SECURE_Val << PIO_S_PIO_IOSSR_P9_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P9_NON_SECURE         (PIO_S_PIO_IOSSR_P9_NON_SECURE_Val << PIO_S_PIO_IOSSR_P9_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P10_Pos               _U_(10)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P10_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P10_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P10(value)            (PIO_S_PIO_IOSSR_P10_Msk & ((value) << PIO_S_PIO_IOSSR_P10_Pos))
#define   PIO_S_PIO_IOSSR_P10_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P10_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P10_SECURE            (PIO_S_PIO_IOSSR_P10_SECURE_Val << PIO_S_PIO_IOSSR_P10_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P10_NON_SECURE        (PIO_S_PIO_IOSSR_P10_NON_SECURE_Val << PIO_S_PIO_IOSSR_P10_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P11_Pos               _U_(11)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P11_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P11_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P11(value)            (PIO_S_PIO_IOSSR_P11_Msk & ((value) << PIO_S_PIO_IOSSR_P11_Pos))
#define   PIO_S_PIO_IOSSR_P11_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P11_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P11_SECURE            (PIO_S_PIO_IOSSR_P11_SECURE_Val << PIO_S_PIO_IOSSR_P11_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P11_NON_SECURE        (PIO_S_PIO_IOSSR_P11_NON_SECURE_Val << PIO_S_PIO_IOSSR_P11_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P12_Pos               _U_(12)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P12_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P12_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P12(value)            (PIO_S_PIO_IOSSR_P12_Msk & ((value) << PIO_S_PIO_IOSSR_P12_Pos))
#define   PIO_S_PIO_IOSSR_P12_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P12_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P12_SECURE            (PIO_S_PIO_IOSSR_P12_SECURE_Val << PIO_S_PIO_IOSSR_P12_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P12_NON_SECURE        (PIO_S_PIO_IOSSR_P12_NON_SECURE_Val << PIO_S_PIO_IOSSR_P12_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P13_Pos               _U_(13)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P13_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P13_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P13(value)            (PIO_S_PIO_IOSSR_P13_Msk & ((value) << PIO_S_PIO_IOSSR_P13_Pos))
#define   PIO_S_PIO_IOSSR_P13_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P13_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P13_SECURE            (PIO_S_PIO_IOSSR_P13_SECURE_Val << PIO_S_PIO_IOSSR_P13_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P13_NON_SECURE        (PIO_S_PIO_IOSSR_P13_NON_SECURE_Val << PIO_S_PIO_IOSSR_P13_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P14_Pos               _U_(14)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P14_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P14_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P14(value)            (PIO_S_PIO_IOSSR_P14_Msk & ((value) << PIO_S_PIO_IOSSR_P14_Pos))
#define   PIO_S_PIO_IOSSR_P14_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P14_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P14_SECURE            (PIO_S_PIO_IOSSR_P14_SECURE_Val << PIO_S_PIO_IOSSR_P14_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P14_NON_SECURE        (PIO_S_PIO_IOSSR_P14_NON_SECURE_Val << PIO_S_PIO_IOSSR_P14_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P15_Pos               _U_(15)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P15_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P15_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P15(value)            (PIO_S_PIO_IOSSR_P15_Msk & ((value) << PIO_S_PIO_IOSSR_P15_Pos))
#define   PIO_S_PIO_IOSSR_P15_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P15_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P15_SECURE            (PIO_S_PIO_IOSSR_P15_SECURE_Val << PIO_S_PIO_IOSSR_P15_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P15_NON_SECURE        (PIO_S_PIO_IOSSR_P15_NON_SECURE_Val << PIO_S_PIO_IOSSR_P15_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P16_Pos               _U_(16)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P16_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P16_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P16(value)            (PIO_S_PIO_IOSSR_P16_Msk & ((value) << PIO_S_PIO_IOSSR_P16_Pos))
#define   PIO_S_PIO_IOSSR_P16_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P16_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P16_SECURE            (PIO_S_PIO_IOSSR_P16_SECURE_Val << PIO_S_PIO_IOSSR_P16_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P16_NON_SECURE        (PIO_S_PIO_IOSSR_P16_NON_SECURE_Val << PIO_S_PIO_IOSSR_P16_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P17_Pos               _U_(17)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P17_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P17_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P17(value)            (PIO_S_PIO_IOSSR_P17_Msk & ((value) << PIO_S_PIO_IOSSR_P17_Pos))
#define   PIO_S_PIO_IOSSR_P17_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P17_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P17_SECURE            (PIO_S_PIO_IOSSR_P17_SECURE_Val << PIO_S_PIO_IOSSR_P17_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P17_NON_SECURE        (PIO_S_PIO_IOSSR_P17_NON_SECURE_Val << PIO_S_PIO_IOSSR_P17_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P18_Pos               _U_(18)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P18_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P18_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P18(value)            (PIO_S_PIO_IOSSR_P18_Msk & ((value) << PIO_S_PIO_IOSSR_P18_Pos))
#define   PIO_S_PIO_IOSSR_P18_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P18_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P18_SECURE            (PIO_S_PIO_IOSSR_P18_SECURE_Val << PIO_S_PIO_IOSSR_P18_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P18_NON_SECURE        (PIO_S_PIO_IOSSR_P18_NON_SECURE_Val << PIO_S_PIO_IOSSR_P18_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P19_Pos               _U_(19)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P19_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P19_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P19(value)            (PIO_S_PIO_IOSSR_P19_Msk & ((value) << PIO_S_PIO_IOSSR_P19_Pos))
#define   PIO_S_PIO_IOSSR_P19_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P19_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P19_SECURE            (PIO_S_PIO_IOSSR_P19_SECURE_Val << PIO_S_PIO_IOSSR_P19_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P19_NON_SECURE        (PIO_S_PIO_IOSSR_P19_NON_SECURE_Val << PIO_S_PIO_IOSSR_P19_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P20_Pos               _U_(20)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P20_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P20_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P20(value)            (PIO_S_PIO_IOSSR_P20_Msk & ((value) << PIO_S_PIO_IOSSR_P20_Pos))
#define   PIO_S_PIO_IOSSR_P20_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
