virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/pio.h
#define   PIO_S_PIO_IOSSR_P20_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P20_SECURE            (PIO_S_PIO_IOSSR_P20_SECURE_Val << PIO_S_PIO_IOSSR_P20_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P20_NON_SECURE        (PIO_S_PIO_IOSSR_P20_NON_SECURE_Val << PIO_S_PIO_IOSSR_P20_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P21_Pos               _U_(21)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P21_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P21_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P21(value)            (PIO_S_PIO_IOSSR_P21_Msk & ((value) << PIO_S_PIO_IOSSR_P21_Pos))
#define   PIO_S_PIO_IOSSR_P21_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P21_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P21_SECURE            (PIO_S_PIO_IOSSR_P21_SECURE_Val << PIO_S_PIO_IOSSR_P21_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P21_NON_SECURE        (PIO_S_PIO_IOSSR_P21_NON_SECURE_Val << PIO_S_PIO_IOSSR_P21_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P22_Pos               _U_(22)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P22_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P22_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P22(value)            (PIO_S_PIO_IOSSR_P22_Msk & ((value) << PIO_S_PIO_IOSSR_P22_Pos))
#define   PIO_S_PIO_IOSSR_P22_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P22_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P22_SECURE            (PIO_S_PIO_IOSSR_P22_SECURE_Val << PIO_S_PIO_IOSSR_P22_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P22_NON_SECURE        (PIO_S_PIO_IOSSR_P22_NON_SECURE_Val << PIO_S_PIO_IOSSR_P22_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P23_Pos               _U_(23)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P23_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P23_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P23(value)            (PIO_S_PIO_IOSSR_P23_Msk & ((value) << PIO_S_PIO_IOSSR_P23_Pos))
#define   PIO_S_PIO_IOSSR_P23_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P23_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P23_SECURE            (PIO_S_PIO_IOSSR_P23_SECURE_Val << PIO_S_PIO_IOSSR_P23_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P23_NON_SECURE        (PIO_S_PIO_IOSSR_P23_NON_SECURE_Val << PIO_S_PIO_IOSSR_P23_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P24_Pos               _U_(24)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P24_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P24_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P24(value)            (PIO_S_PIO_IOSSR_P24_Msk & ((value) << PIO_S_PIO_IOSSR_P24_Pos))
#define   PIO_S_PIO_IOSSR_P24_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P24_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P24_SECURE            (PIO_S_PIO_IOSSR_P24_SECURE_Val << PIO_S_PIO_IOSSR_P24_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P24_NON_SECURE        (PIO_S_PIO_IOSSR_P24_NON_SECURE_Val << PIO_S_PIO_IOSSR_P24_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P25_Pos               _U_(25)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P25_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P25_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P25(value)            (PIO_S_PIO_IOSSR_P25_Msk & ((value) << PIO_S_PIO_IOSSR_P25_Pos))
#define   PIO_S_PIO_IOSSR_P25_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P25_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P25_SECURE            (PIO_S_PIO_IOSSR_P25_SECURE_Val << PIO_S_PIO_IOSSR_P25_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P25_NON_SECURE        (PIO_S_PIO_IOSSR_P25_NON_SECURE_Val << PIO_S_PIO_IOSSR_P25_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P26_Pos               _U_(26)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P26_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P26_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P26(value)            (PIO_S_PIO_IOSSR_P26_Msk & ((value) << PIO_S_PIO_IOSSR_P26_Pos))
#define   PIO_S_PIO_IOSSR_P26_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P26_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P26_SECURE            (PIO_S_PIO_IOSSR_P26_SECURE_Val << PIO_S_PIO_IOSSR_P26_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P26_NON_SECURE        (PIO_S_PIO_IOSSR_P26_NON_SECURE_Val << PIO_S_PIO_IOSSR_P26_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P27_Pos               _U_(27)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P27_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P27_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P27(value)            (PIO_S_PIO_IOSSR_P27_Msk & ((value) << PIO_S_PIO_IOSSR_P27_Pos))
#define   PIO_S_PIO_IOSSR_P27_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P27_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P27_SECURE            (PIO_S_PIO_IOSSR_P27_SECURE_Val << PIO_S_PIO_IOSSR_P27_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P27_NON_SECURE        (PIO_S_PIO_IOSSR_P27_NON_SECURE_Val << PIO_S_PIO_IOSSR_P27_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P28_Pos               _U_(28)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P28_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P28_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P28(value)            (PIO_S_PIO_IOSSR_P28_Msk & ((value) << PIO_S_PIO_IOSSR_P28_Pos))
#define   PIO_S_PIO_IOSSR_P28_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P28_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P28_SECURE            (PIO_S_PIO_IOSSR_P28_SECURE_Val << PIO_S_PIO_IOSSR_P28_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P28_NON_SECURE        (PIO_S_PIO_IOSSR_P28_NON_SECURE_Val << PIO_S_PIO_IOSSR_P28_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P29_Pos               _U_(29)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P29_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P29_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P29(value)            (PIO_S_PIO_IOSSR_P29_Msk & ((value) << PIO_S_PIO_IOSSR_P29_Pos))
#define   PIO_S_PIO_IOSSR_P29_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P29_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P29_SECURE            (PIO_S_PIO_IOSSR_P29_SECURE_Val << PIO_S_PIO_IOSSR_P29_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P29_NON_SECURE        (PIO_S_PIO_IOSSR_P29_NON_SECURE_Val << PIO_S_PIO_IOSSR_P29_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P30_Pos               _U_(30)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P30_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P30_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P30(value)            (PIO_S_PIO_IOSSR_P30_Msk & ((value) << PIO_S_PIO_IOSSR_P30_Pos))
#define   PIO_S_PIO_IOSSR_P30_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P30_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P30_SECURE            (PIO_S_PIO_IOSSR_P30_SECURE_Val << PIO_S_PIO_IOSSR_P30_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P30_NON_SECURE        (PIO_S_PIO_IOSSR_P30_NON_SECURE_Val << PIO_S_PIO_IOSSR_P30_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P31_Pos               _U_(31)                                              /**< (PIO_S_PIO_IOSSR) I/O Security Status Position */
#define PIO_S_PIO_IOSSR_P31_Msk               (_U_(0x1) << PIO_S_PIO_IOSSR_P31_Pos)                /**< (PIO_S_PIO_IOSSR) I/O Security Status Mask */
#define PIO_S_PIO_IOSSR_P31(value)            (PIO_S_PIO_IOSSR_P31_Msk & ((value) << PIO_S_PIO_IOSSR_P31_Pos))
#define   PIO_S_PIO_IOSSR_P31_SECURE_Val      _U_(0x0)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode.  */
#define   PIO_S_PIO_IOSSR_P31_NON_SECURE_Val  _U_(0x1)                                             /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode.  */
#define PIO_S_PIO_IOSSR_P31_SECURE            (PIO_S_PIO_IOSSR_P31_SECURE_Val << PIO_S_PIO_IOSSR_P31_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Secure mode. Position  */
#define PIO_S_PIO_IOSSR_P31_NON_SECURE        (PIO_S_PIO_IOSSR_P31_NON_SECURE_Val << PIO_S_PIO_IOSSR_P31_Pos) /**< (PIO_S_PIO_IOSSR) The I/O line of the I/O group 0 is in Non-Secure mode. Position  */
#define PIO_S_PIO_IOSSR_Msk                   _U_(0xFFFFFFFF)                                      /**< (PIO_S_PIO_IOSSR) Register Mask  */

